<?php
/* This file is part of BBClone (The PHP web counter on steroids)
 *
 * $Header: /cvs/bbclone/language/bg.php,v 1.29 2004/10/17 14:08:39 olliver Exp $
 *
 * Copyright (C) 2001-2004, the BBClone Team (see file doc/authors.txt
 * distributed with this library)
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * See doc/copying.txt for details
 *
 * Translated by Martin Halachev < m_halachev@hotmail.com >
 */


// The main array ($_ is for doing short in its call)
$_ = array(
// Specific charset
"global_charset" => "windows-1251",

// Date format (used with date() )
"global_date_format" => "Y/m/d",

// Global translation
"global_bbclone_copyright" => "The BBClone team - Лицензирано съгласно",
"global_last_reset" => "Последно анулиране на статистиката на ",
"global_yes" => "Да",
"global_no" => "Не",

// The error messages
"error_cannot_see_config" =>
"Вие нямате позволения за разглеждане на конфигурацията на BBClone на този сървър.",

// Address Extensions
"numeric" => "IP Адрес", "com" => "Търговски",
"net" => "Мрежови", "edu" => "Образователен",
"biz" => "Бизнес", "info" => "Инфо",
"name" => "Personal", "ps" => "Палестина",
"jp" => "Япония", "us" => "САЩ",
"uk" => "Велокобритания", "de" => "Германия",
"mil" => "САЩ военен", "ca" => "Канада",
"it" => "Италия", "au" => "Австралия",
"org" => "Организация", "nl" => "Холандия",
"fr" => "Франция", "tw" => "Тайван",
"gov" => "Правителствен", "fi" => "Финландия",
"br" => "Бразизия", "se" => "Швеция",
"es" => "Испания", "no" => "Норвегия",
"mx" => "Мексико", "kr" => "Корея",
"ch" => "Швейцария", "dk" => "Дания",
"be" => "Белгия", "at" => "Австрия",
"nz" => "Нова Зеландия", "ru" => "Русия",
"pl" => "Полша", "za" => "ЮАР",
"unknown" => "Непознат", "ar" => "Аржентина",
"il" => "Израел", "sg" => "Сингапур",
"arpa" => "ARPA", "cz" => "Чехия",
"hu" => "Унгария", "hk" => "Хонг-Конг",
"pt" => "Португалия", "tr" => "Турция",
"gr" => "Гърция", "cn" => "Китай",
"ie" => "Ирландия", "my" => "Малайзия",
"th" => "Тайланд", "cl" => "Китай",
"co" => "Колумбия", "is" => "Исландия",
"uy" => "Уругвай", "ee" => "Естония",
"in" => "Индия", "ua" => "Украйна",
"sk" => "Словакия", "ro" => "Румъния",
"ae" => "Обединени арабски емирства", "id" => "Индонезия",
"su" => "Съветски съюз", "si" => "Словения",
"hr" => "Хърватия", "ph" => "Филипини",
"lv" => "Латвия", "ve" => "Венецуела",
"bg" => "България", "lt" => "Литва",
"yu" => "Югославия", "lu" => "Люксембург",
"nu" => "Ниуе", "pe" => "Перу",
"cr" => "Коста рика", "int" => "Международна организация",
"do" => "Доминиканска република", "cy" => "Кипър",
"pk" => "Пакистан", "cc" => "Кокосови о-ви",
"tt" => "Тринидад и Тобаго", "eg" => "Египет",
"lb" => "Ливан", "kw" => "Кувейт",
"to" => "Тонга", "kz" => "Казахстан",
"na" => "Намибия", "mu" => "Мавриций",
"bm" => "Бермуда", "sa" => "Саудитска Арабия",
"zw" => "Зимбабве", "kg" => "Киргизстан",
"cx" => "Коледни о-ви", "pa" => "Панама",
"gt" => "Гватемала", "bw" => "Ботсвана",
"mk" => "Македония", "gl" => "Гренландия",
"ec" => "Еквадор", "lk" => "Шри Ланка",
"md" => "Молдова", "py" => "Парагвай",
"bo" => "Боливия", "bn" => "Бруней",
"mt" => "Малта", "fo" => "Фаройски о-ви",
"ac" => "о-в Възнесение", "pr" => "Пуерт Рико",
"am" => "Армения", "pf" => "Френска Полинезия",
"ge" => "Грузия", "bh" => "Бахрейн",
"ni" => "Никарагуа", "by" => "Беларус",
"sv" => "Салвадор", "ma" => "Мароко",
"ke" => "Кения", "ad" => "Андора",
"zm" => "Замбия", "np" => "Непал",
"bt" => "Бутан", "sz" => "Свазиленд",
"ba" => "Босна и Херцеговина", "om" => "Оман",
"jo" => "Йордания", "ir" => "Иран",
"st" => "Сао Том и Принсип", "vi" => "Вирджински Острови (САЩ)",
"ci" => "Бряг на слоновата кост", "jm" => "Ямайка",
"li" => "Лихтенщайн", "ky" => "Кайманови Острови",
"gp" => "Гуаделуп", "mg" => "Мадагаскар",
"gi" => "Гибралтар", "sm" => "Сан Марино",
"as" => "Американска Самоа", "tz" => "Танзания",
"ws" => "Самоа", "tm" => "Туркменистан",
"mc" => "Монако", "sn" => "Сенегал",
"hm" => "Острови Херд и Макдоналд", "fm" => "Микронезия",
"fj" => "Фиджи", "cu" => "Куба",
"rw" => "Руанда", "mq" => "Мартиника",
"ai" => "Ангила", "pg" => "Папуа Нова Гвинея",
"bz" => "Белиз", "sh" => "Св. Елена",
"aw" => "Аруба", "mv" => "Малдиви",
"nc" => "Нова Каледония", "ag" => "Антигуа и Барбуда",
"uz" => "Узбекистан", "tj" => "Таджикистан",
"sb" => "Соломонови о-ви", "bf" => "Буркина Фасо",
"kh" => "Камбоджа", "tc" => "Туркс и Кайкос о-ви",
"tf" => "Френски южни територии", "az" => "Азърбайджан",
"dm" => "Доминика", "mz" => "Мозамбик",
"mo" => "Макао", "vu" => "Вануату",
"mn" => "Монголия", "ug" => "Уганда",
"tg" => "Того", "ms" => "Монтсерат",
"ne" => "Нигер", "gf" => "Френска Гвиана",
"gu" => "Гуам", "hn" => "Хондурас",
"al" => "Албания", "gh" => "Гана",
"nf" => "О-в Норфолк", "io" => "Британски територии в Индийския океан",
"gs" => "Южна Джорджия и о-ви Южен Сандвич", "ye" => "Йемен",
"an" => "Холандски Антили", "aq" => "Антарктика",
"tn" => "Тунис", "ck" => "о-ви Кук",
"ls" => "Лесото", "et" => "Етиопия",
"ng" => "Нигерия", "sl" => "Сиера Леоне",
"bb" => "Барбадос", "je" => "Джърси",
"vg" => "Вирджински о-ви (Великобритания)", "vn" => "Виетнам",
"mr" => "Мавритания", "gy" => "Гвиана",
"ml" => "Мали", "ki" => "Кирибати",
"tv" => "Тувалу", "dj" => "Джибути",
"km" => "Коморос", "dz" => "Алжир",
"im" => "О-в Ман", "pn" => "о-в Питкаирн",
"qa" => "Катар", "gg" => "Гуернси",
"bj" => "Бенин", "ga" => "Габон",
"gb" => "Великобритания", "bs" => "Бахами",
"va" => "Ватикана", "lc" => "Света Лусия",
"cd" => "Конго", "gm" => "Гамбия",
"mp" => "О-ви Северна Мариана", "gw" => "Гвинея-Бисау",
"cm" => "Камерун", "ao" => "Ангола",
"er" => "Еритрея", "ly" => "Либия",
"cf" => "Централна Африканска Република", "mm" => "Мианмар",
"td" => "ЧАД", "iq" => "Ирак",
"kn" => "Свети Киттс и Невис", "sc" => "Сейшелски о-ви",
"cg" => "Конго", "gd" => "Гренада",
"nr" => "Науру", "af" => "Афганистан",
"cv" => "Острови Зелен нос", "mh" => "Маршалови о-ви",
"pm" => "Свети Пиер и Микулон", "so" => "Сомалия",
"vc" => "Свети Винсент и Гренадини", "bd" => "Бангладеш",
"gn" => "Гвинея", "ht" => "Хаити",
"la" => "Лаос", "lr" => "Либерия",
"mw" => "Малави", "pw" => "Палау",
"re" => "Реюнион", "tk" => "Токелау",
"bi" => "Бурунди", "bv" => "Буве",
"fk" => "Фолкледски о-ви", "gq" => "Екваториална Гвинея",
"sd" => "Судан", "sj" => "О-ви Свалбард и Ян Майен",
"sr" => "Суринам", "sy" => "Сирия",
"tp" => "Източен Тимор", "um" => "САЩ отделни о-ви",
"wf" => "о-ви Уолис и Футуна", "yt" => "Майот",
"zr" => "Заир",

// Miscellaneous translations
"misc_other" => "Друг",
"misc_unknown" => "Непознат",
"misc_second_unit" => "сек.",

// The Navigation Bar
"navbar_Main_Site" => "Основен сайт",
"navbar_Configuration" => "Конфигурация",
"navbar_Global_Stats" => "Обобщена статистика",
"navbar_Detailed_Stats" => "Подробна статистика",
"navbar_Time_Stats" => "Статистика по време",

// Detailed stats words
"dstat_id" => "ID",
"dstat_time" => "Време",
"dstat_visits" => "Посещения",
"dstat_extension" => "Домейн",
"dstat_dns" => "Име на хост",
"dstat_from" => "Референт",
"dstat_os" => "Операционна с/ма",
"dstat_browser" => "Браузер",
"dstat_visible_rows" => "Последни",
"dstat_green_rows" => "зелени редове",
"dstat_blue_rows" => "сини редове",
"dstat_red_rows" => "червени редове",
"dstat_last_visit" => "последно посещение",
"dstat_robots" => "роботи",
"dstat_no_data" => "Няма налични данни",
"dstat_prx" => "Прокси сървър",
"dstat_ip" => "IP Адрес",
"dstat_user_agent" => "Потребителски агент",
"dstat_nr" => "No",
"dstat_pages" => "Страници",
"dstat_visit_length" => "Време",
"dstat_reloads" => "Обновявания",

// Global stats words
"gstat_Accesses" => "Посещаемост",
"gstat_Total_visits" => "Посещения общо",
"gstat_Total_unique" => "Посещения уникални",
"gstat_Operating_systems" => "Топ %d операционни с/ми",
"gstat_Browsers" => "Топ %d браузери",
"gstat_extensions" => "Топ %d домейни",
"gstat_Robots" => "Топ %d роботи",
"gstat_pages" => "Топ %d посещаеми страници",
"gstat_origins" => "Топ %d референти",
"gstat_hosts" => "Топ %d хостове",
"gstat_keys" => "Top %d ключови думи",
"gstat_Total" => "Общо",
"gstat_Not_specified" => "Директни",

// Time stats words
"tstat_Su" => "Нед",
"tstat_Mo" => "Пон",
"tstat_Tu" => "Вт",
"tstat_We" => "Ср",
"tstat_Th" => "Чет",
"tstat_Fr" => "Пет",
"tstat_Sa" => "Съб",

"tstat_Jan" => "Яну",
"tstat_Feb" => "Фев",
"tstat_Mar" => "Мар",
"tstat_Apr" => "Апр",
"tstat_May" => "Май",
"tstat_Jun" => "Юни",
"tstat_Jul" => "Юли",
"tstat_Aug" => "Авг",
"tstat_Sep" => "Сеп",
"tstat_Oct" => "Окт",
"tstat_Nov" => "Ное",
"tstat_Dec" => "Дек",

"tstat_last_day" => "Последен ден",
"tstat_last_week" => "Последна седмица",
"tstat_last_month" => "Последен месец",
"tstat_last_year" => "Последна година",

// Configuration page words and sentences
"config_Variable_name" => "Име на променлива",
"config_Variable_value" => "Стойност",
"config_Explanations" => "Описание",

"config_bbc_mainsite" =>
"Ако е зададена стойност на тази променлива, към навигационната лента на BBClone ще бъде добавена връзка към зададеното местоположение. Стойността по подразбиране е предната директория. В случай, че вашият основен сайт се намира на друго място, вероятно ще пожелаете да зададете стойност според вашите нужди.<br />
Примери:<br />
\$BBC_MAINSITE = &quot;http://www.myserver.com/&quot;<br />
\$BBC_MAINSITE = &quot;..&quot;<br />
\$BBC_MAINSITE = &quot;&quot;;",

"config_bbc_show_config" =>
"По подразбиране BBClone показва своите настройки. В случай, че не желаете това, можете да забраните достъпа като деактивирате тази опция.<br />
Примери:<br />
\$BBC_SHOW_CONFIG = 1;<br />
\$BBC_SHOW_CONFIG = &quot;&quot;;",

"config_bbc_titlebar" =>
"Заглавието на навигационната лента на всички bbclonе страници.<br />
Следващите макроси са използваеми:<br />
<ul>
<li>%SERVER: име на сървъра,</li>
<li>%DATE: текуща дата.</li>
</ul>
HTML тагове също са позволени.<br />
Examples:<br />
\$BBC_TITLEBAR = &quot;Statistics for %SERVER generated the %DATE&quot;;<br />
\$BBC_TITLEBAR = &quot;My Statistics from %DATE look like this:&quot;;<br />",

"config_bbc_language" =>
"Езикът по подразбиране на BBClone, в случай, че не е спесифициран от браузерa.
Поддържат се следните езици:
<p>bg, ca, cs, da, de, el, en, es, fi, fr, hu, it, ja, lt, nb, nl, pl, pt-br, ro, ru,
se, sl, tr and zh-cn</p>",

"config_bbc_maxtime" =>
"Тази променлива дефинира дължината на всяко уникално посещение в секунди. Всяко попадение от същия посетител в рамките на този период ще бъде третирано като едно посещение, докато две последователни попадения не надвишат указания лимит. По подразбиране е де факто уеб стандартът от 30 минути (1800 секунди), но в зависимост от вашите нужди, можете да зададете друга стойност.<br />
Примери:<br />
\$BBC_MAXTIME = 0;<br />
\$BBC_MAXTIME = 1800;",

"config_bbc_maxvisible" =>
"Колко записа желаете да имате в подробната статистика?
По подразбиране е 100, препоръчително е да не използвате повече от 500 за да избегнете натоварване.",

"config_bbc_detailed_stat_fields" =>
"Променливата \$BBC_DETAILED_STAT_FIELDS  определя колоните, показвани в подробната статистика. Възможните колони са:
<ul>
<li>id&nbsp;=&gt;&nbsp; x-тия поред посетител след стартирането на статистиката</li>
<li>time&nbsp;=&gt;&nbsp;Времето, когато е регистрирано последното посещение</li>
<li>visits&nbsp;=&gt;&nbsp;Общия брой попадения на уникален посетител</li>
<li>dns&nbsp;=&gt;&nbsp;Името на хоста на посетителя</li>
<li>ip&nbsp;=&gt;&nbsp;IP адреса на посетителя</li>
<li>os&nbsp;=&gt;&nbsp;Операционната система (ако е достъпна и/или робот)</li>
<li>browser&nbsp;=&gt;&nbsp;Софтуера, използван за осъществяване на връзката
</li>
<li>ext&nbsp;=&gt;&nbsp;Държавата или разширението на посетителя</li>
<li>referer&nbsp;=&gt;&nbsp;The link from which a visitor came (if available)
</li>
</ul>
Същият ред, в който сте подредили колоните, ще бъде използван за представяне.<br />
Примери:<br />
\$BBC_DETAILED_STAT_FIELDS = &quot;id, time, visits, ip, ext, os, browser&quot;;
<br />
\$BBC_DETAILED_STAT_FIELDS = &quot;date, ext, browser, os, ip&quot;;<br />",

"config_bbc_time_offset" =>
"В случай, че времето на сървъра не съвпада с вашата часова зона, вие можете да нагласите времето в минути, използвайки тази променлива. Отрицателните стойности задават времето назад,
положителните - напред.<br />
Примери:<br />
\$BBC_TIME_OFFSET = 300;<br />
\$BBC_TIME_OFFSET = -300;<br />
\$BBC_TIME_OFFSET = 0;",

"config_bbc_no_dns" =>
"Тази опция дефинира, дали IP адресите да бъдат преобразувани имена на хостове или не. Имената на хостове могат да дадат повече информация за посетителя, но тяхното преобразуване може значително да забави вашия сайт, ако използваните DNS сървъри са бавни, с ограничен капацитет или по ненадеждни друга причина. Указването на тази променлива може да реши проблема.<br />
Примери:<br />
\$BBC_NO_DNS = 1;<br />
\$BBC_NO_DNS = &quot;&quot;;",

"config_bbc_no_hits" =>
"По подразбиране BBClone показва всички попадения във статистиката по време, защото това дава полезна информация за натоварването на сървъра. Ако обаче предпочитате да използвате само уникалните посещения, можете да промените начина на отчитане като зададете тази променлива.<br />
Примери:<br />
\$BBC_NO_HITS = 1;<br />
\$BBC_NO_HITS = &quot;&quot;;",

"config_bbc_ignore_ip" =>
"Тази опция може да се използва за да се игнорират определени IP адреси или мрежи от отчитане. Ако желаете да зададете няколко израза, използвайте запетая за разделител.<br />
Примери:<br />
\$BBC_IGNORE_IP = &quot;127., 192.168.&quot;;<br />
\$BBC_IGNORE_IP = &quot;&quot;;",

"config_bbc_ignore_refer" =>
"В случай, че не желаете определени референти да бъдат отчитани във вашата подробна и обобщена статистика, можете да зададете една или повече ключови думи за блокиране на референт при съвпадение. Ако зададете няколко ключови думи, използвайте запетая за разделител.<br />
Примери:<br />
\$BBC_IGNORE_REFER = &quot;spambot.org, .escort.&quot;;<br />
\$BBC_IGNORE_REFER = &quot;&quot;;",

"config_bbc_ignore_bots" =>
"Тази променлива определя начина, по който ще бъдат третирани роботите. По подразбиране те се игнорират в списъка на топ хостовете, като се отчитат в останалата част от статистиката. В случай, че не желаете да виждате никакви роботи, задайте на променливата стойност
&quot;2&quot;, при което само реалните заявки ще бъдат регистрирани.<br />
Примери:<br />
\$BBC_IGNORE_BOTS = 2;<br />
\$BBC_IGNORE_BOTS = 1;<br />
\$BBC_IGNORE_BOTS = &quot;&quot;;",

"config_bbc_ignore_agent" =>
"Тази опция дефинира начина, по който BBClone различава един потребител от друг. По подразбиране това се осъществява само посредством IP адреса, което дава реална представа в повечето случаи. Ако обаче, вашите посетители често се намират зад прокси сървъри, деактивирането на тази опция може да даде по-реална представа, след като новия посетител бъде определен при промяната на потребителския агент.<br />
Примери:<br />
\$BBC_IGNORE_AGENT = 1;<br />
\$BBC_IGNORE_AGENT = &quot;&quot;;",

"config_bbc_kill_stats" =>
"Когато желаете да анулирате статистиката, можете да активирате тази променлива и съдържанието ще бъде изтрито при следващо посещение. Не забравяйте да деактивирате променливата след това, в противен случай вероятно ще наблюдавате изключително нисък трафик ;).<br />
Примери:<br />
\$BBC_KILL_STATS = 1;<br />
\$BBC_KILL_STATS = &quot;&quot;;",

"config_bbc_purge_single" =>
"Статистиката за хостове и референти може да генерира огромно количество данни, повечето
от които в следствие на еднократни посещения. Задавайки тази опция, вие можете да изчистите тези данни и значително да намалите големината на файла access.php без това да засегне видимата подредба на хостовете и референтите. Количеството посещения ще бъде добавено към
категорията &quot;not_specified&quot;  за да се запазят общите показатели непроменени.<br />
Примери:<br />
\$BBC_PURGE_SINGLE = 1;<br />
\$BBC_PURGE_SINGLE = &quot;&quot;;"

);
?>