<?xml version="1.0" encoding="ISO-8859-1"?>
<!-- ***** BEGIN LICENSE BLOCK *****
   - This file is part of DotClear.
   - Copyright (c) 2004 Olivier Meunier and contributors. All rights
   - reserved.
   -
   - DotClear is free software; you can redistribute it and/or modify
   - it under the terms of the GNU General Public License as published by
   - the Free Software Foundation; either version 2 of the License, or
   - (at your option) any later version.
   - 
   - DotClear is distributed in the hope that it will be useful,
   - but WITHOUT ANY WARRANTY; without even the implied warranty of
   - MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   - GNU General Public License for more details.
   - 
   - You should have received a copy of the GNU General Public License
   - along with DotClear; if not, write to the Free Software
   - Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
   -
   - ***** END LICENSE BLOCK ***** -->
<html>
<head>
  <title>Eintr&auml;ge</title>
</head>
<body>
<h1>Erstellen von Eintr&auml;gen<br>
</h1>
<p>Um einen neuen Eintrag zu erstellen, muss das Register <em>Eintr&auml;ge</em>
angew&auml;hlt werden und auf den Link <em>Neuer Eintrag</em> geklickt
werden.</p>
<p>Ein Eintrag besteht mindestens aus einem Titel und dessen Eintrag.
Daneben ist es m&ouml;glich, eine Kategorie zu w&auml;hlen.</p>
<h2>Felder</h2>
<dl>
  <dt id="category">Kategorie</dt>
  <dd>Die Kategorie des Eintrages. Um Kategorien zu bearbeiten muss
in das Register <em>Kategorien</em> gewechselt werden.</dd>
  <dt id="format">Format</dt>
  <dd>Eintr&auml;ge k&ouml;nnen in zwei Formaten erstellt werden;
Wiki oder HTML. Das Wiki Format ist eine vereinfachte Syntax um
Eintr&auml;ge schnell, einfach und mit minimalem Training zu erfassen.
Daneben stellt HTML die gesamte Bandbreite an Funktionen zur
Verf&uuml;gung, um Eintr&auml;ge zu definieren und anzupassen.</dd>
  <dt id="status">Status</dt>
  <dd>Der Status legt fest, ob der Eintrag in DotClear erscheint
(<em>Online</em>) oder nicht (<em>Offline</em>).<br>
  </dd>
  <dt id="comment">Kommentare</dt>
  <dd>Das Auswahlfeld erlaubt einem festzulegen, ob Kommentare f&uuml;r
diesen
Eintrag erlaubt sind.</dd>
  <dt id="trackback">Trackbacks</dt>
  <dd>Trackbacks sind Kommentare von anderen Weblogs, welche auf den
Titel oder Inhalt eines Eintrages verweisen. Das Feld erlaubt einem
Trackbacks zu aktivieren oder zu deaktivieren.</dd>
  <dt id="language">Sprache</dt>
  <dd>Der Sprachcode f&uuml;r den Eintrag. Standardm&auml;ssig ist dies
der Sprachcode, welcher in den pers&ouml;nlichen Einstellungen
hinterlegt ist. Der Sprachcode kann jedoch f&uuml;r jeden Eintrag
ge&auml;ndert werden. Um Falle eines englischen Eintrages k&ouml;nnen
zum
Beispiel "en" oder "en-us" gesetzt werden. Der Sprachcode wird bei der
Anzeige
der Eintr&auml;ge angezeigt.</dd>
  <dt id="selected">Spezialeintrag</dt>
  <dd>Um einen Eintrag besonders hervorzuheben kann dieser mit dem
Auswahlfeld
Spezialeintrag markiert werden. <br>
  </dd>
  <dt id="title">Titel</dt>
  <dd>Der Titel des Eintrages. Dies ist ein Muss-Feld.<br>
  </dd>
  <dt id="title_url">URL Titel<br>
  </dt>
  <dd>Der URL Titel ist der Name, welche die URL's f&uuml;r die
entsprechende Kategorie bekommen werden. Accents und Sonderzeichen
werden aus dem URL Titel gel&ouml;scht. Im Gegenssatz zu Kategorien ist
das setzen des URL Titels freiwillig, jedoch empfohlen.</dd>
  <dt id="abstract">Zusammenfassung / Einleitung<br>
  </dt>
  <dd>Die Zusammenfassung erlaubt das Verfassen einer kurzen
Einf&uuml;hrung. Wird die Zusammenfassung erfasst, so ist der Rest des
Eintrages nach dem Anklicken eines Links einsehbar. Ansonsten wird der
komplette Artikel auf der Frontseite dargestellt.</dd>
  <dt id="entry">Eintrag</dt>
  <dd>Der Text des Eintrages. Dies ist ein Muss-Feld.<br>
  </dd>
  <dt id="insertImage">Bild einf&uuml;gen<br>
  </dt>
  <dd>Wird auf das Icon <em>internes Bild</em> geklickt, so erscheint
ein
Fenster, in welchem ein Bild gew&auml;hlt werden kann, welches in den
Text eingef&uuml;gt wird.</dd>
  <dt id="notepad">Notizen</dt>
  <dd>Das Feld Notizen erlaubt es dem Autor gewisse Informationen
&uuml;ber den
Eintrag zu sichern. Diese Information erscheint nicht im Weblog. <br>
  </dd>
  <dt id="datetime">Datum und Uhrzeit<br>
  </dt>
  <dd>Sofern der Eintrag gespeichert wurde, kann das Datum und die
Uhrzeit des Eintrages angepasst werden.<br>
  </dd>
</dl>
<h2>Aktionen</h2>
<dl>
  <dt>Vorschau</dt>
  <dd>Um den Eintrag zu &uuml;berpr&uuml;fen, bevor er gespeichert
wird, kann mit der Schaltfl&auml;che Vorschau die Vorschau aufgerufen
werden. Bitte beachten: Smileys, sofern im Weblog aktiviert,
funktionieren in
dieser Ansicht nicht. <br>
    <strong>Shortcut: alt+v</strong>.</dd>
  <dt>Speichern</dt>
  <dd>Damit wird der Eintrag gespeichert. <br>
    <strong>Shortcut: alt+s</strong>.</dd>
  <dt>L&ouml;schen</dt>
  <dd>Damit wird der Eintrag gel&ouml;scht.<br>
  </dd>
</dl>
<h2>Kommentare hinzuf&uuml;gen<br>
</h2>
<p>Sobald der Eintrag gespeichert ist, ist es m&ouml;glich aus dem
Backend Kommentare hinzuzuf&uuml;gen.<br>
</p>
</body>
</html>
